Revit 2027 API
EmbodiedCarbonAsset.CarbonCoefficientUnitType Property
 The unit type of Embodied Carbon coefficient (e.g. kgCO₂e/m, kgCO₂e/kg,...)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EmbodiedCarbonCoefficientUnitType CarbonCoefficientUnitType { get; }
Public ReadOnly Property CarbonCoefficientUnitType As EmbodiedCarbonCoefficientUnitType
	Get
public:
property EmbodiedCarbonCoefficientUnitType CarbonCoefficientUnitType {
	EmbodiedCarbonCoefficientUnitType get ();
}
member CarbonCoefficientUnitType : EmbodiedCarbonCoefficientUnitType with get
Property Value
EmbodiedCarbonCoefficientUnitType
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace